snlkuharlocal/src/Documents/Перемаркировка/Перемаркировка.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Перемаркировка</name>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоКомплектующих</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>8</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОтгрузкаКомплектов</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыПеремаркировки</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокОснование</name>
    <type>
      <types>DocumentRef.ЛистПереукладки</types>
      <types>DocumentRef.ЛистНабора</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>СозданАвтоматически</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИДСтроки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Коэффициент</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Комплектующие</name>
    <attributes>
      <name>Продукция</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоПродукции</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИДСтроки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Коэффициент</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТоварыУдаленные</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДокументыОснования</name>
    <attributes>
      <name>ДокОснование</name>
      <type>
        <types>DocumentRef.ЛистПереукладки</types>
        <types>DocumentRef.ЛистНабора</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ВидыКомплектов</name>
    <attributes>
      <name>ВидКомплекта</name>
      <type>
        <types>EnumRef.ВидыКомплектов</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

snlkuharlocal/src/Enums/СтатусыПеремаркировки/СтатусыПеремаркировки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыПеремаркировки</name>
  <enumValues>
    <name>ВРаботе</name>
  </enumValues>
  <enumValues>
    <name>КОтработкеЧЗ</name>
  </enumValues>
  <enumValues>
    <name>ОбработаноЧЗ</name>
  </enumValues>
  <enumValues>
    <name>КОтправкеНаСклад</name>
  </enumValues>
  <enumValues>
    <name>ПолученоСкладом</name>
  </enumValues>
  <enumValues>
    <name>Сканирование</name>
  </enumValues>
  <enumValues>
    <name>Обработано</name>
  </enumValues>
</mdclass:Enum>

snlkuharlocal/src/Enums/ВидыКомплектов/ВидыКомплектов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыКомплектов</name>
  <enumValues>
    <name>Комплект</name>
  </enumValues>
  <enumValues>
    <name>Ассортито</name>
  </enumValues>
  <enumValues>
    <name>Товар</name>
  </enumValues>
  <enumValues>
    <name>ГотовыйКомплект</name>
  </enumValues>
  <enumValues>
    <name>АссортитоКомплектов</name>
  </enumValues>
</mdclass:Enum>

snlkuharlocal/src/Documents/Перемаркировка/Forms/ФормаДокумента/Module.bsl
#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	УправлениеВидимостью(); 
	УправлениеДоступностью(); 
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	УправлениеВидимостью(); 
	УправлениеДоступностью(); 
КонецПроцедуры


#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы
&НаКлиенте
Процедура ОтгрузкаКомплектовПриИзменении(Элемент)
	УправлениеВидимостью();
	Если Не Объект.ОтгрузкаКомплектов Тогда 
		Объект.Комплектующие.Очистить();
	КонецЕсли;
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыТовары
&НаКлиенте
Процедура ТоварыНоменклатураПриИзменении(Элемент)
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные; 
	Если ТекущиеДанные = Неопределено Тогда
		Возврат; 
	КонецЕсли;
	ТекущиеДанные.Коэффициент 	= 1; 
	ТекущиеДанные.Количество 	= 1; 
	Если ВведенныйТоварСпайка(ТекущиеДанные.Номенклатура) Тогда
		Объект.ОтгрузкаКомплектов = Истина; 
		УправлениеВидимостью(); 
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПослеУдаления(Элемент)
	Если ТипЗнч(СтрокаДляУдаления) = Тип("Структура") Тогда
		НоваяСтрока = Объект.ТоварыУдаленные.Добавить(); 
		ЗаполнитьЗначенияСвойств(НоваяСтрока,СтрокаДляУдаления );
		СтрокаДляУдаления = Неопределено;
		ОтработатьУдалениеНоменклатурыНаСервере(); 
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПередУдалением(Элемент, Отказ)
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные; 
	Если ТекущиеДанные = Неопределено Тогда
		Возврат; 	
	КонецЕсли;
	
	СтрокаДляУдаления = Новый Структура("Номенклатура,Количество");
	ЗаполнитьЗначенияСвойств(СтрокаДляУдаления, ТекущиеДанные);
	Если Отказ Тогда
		СтрокаДляУдаления = Неопределено; 	
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные; 
	Если ТекущиеДанные = Неопределено Тогда
		Возврат; 	
	КонецЕсли;
	Если КоличествоТовараСтроки > ТекущиеДанные.Количество Тогда
	
		НоваяСтрока = Объект.ТоварыУдаленные.Добавить(); 
		ЗаполнитьЗначенияСвойств(НоваяСтрока,ТекущиеДанные );	
	    НоваяСтрока.Количество = КоличествоТовараСтроки - ТекущиеДанные.Количество;
	ИначеЕсли КоличествоТовараСтроки < ТекущиеДанные.Количество Тогда
		Если Объект.Статус <> ПредопределенноеЗначение("Перечисление.СтатусыПеремаркировки.ВРаботе") Тогда
		
			 ТекущиеДанные.Количество = КоличествоТовараСтроки; 
			 Сообщить("Менять количество на большее можно только в статусе ""В работе"""); 
		
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПередНачаломИзменения(Элемент, Отказ)
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные; 
	Если ТекущиеДанные = Неопределено Тогда
		Возврат; 	
	КонецЕсли;
	КоличествоТовараСтроки = ТекущиеДанные.Количество; 
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура Подбор(Команда)
	
	ОписаниеОповещенияВыбор = Новый ОписаниеОповещения("ПослеВыбораНоменклатуры", ЭтотОбъект);
	ПараметрОткрытияФормы = Новый Структура("РежимВыбора,МножественныйВыбор,ЗакрыватьПриВыборе", Истина, Истина,истина);

	ОткрытьФорму("Справочник.Номенклатура.Форма.ФормаВыбораУпр", ПараметрОткрытияФормы, ЭтотОбъект, , , ,
		ОписаниеОповещенияВыбор);
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьКомплектующие(Команда)
	Объект.Комплектующие.Очистить();	
	ЗаполнитьКомплектующиеНаСервере(); 
КонецПроцедуры
#КонецОбласти


#Область СлужебныеПроцедурыИФункции
&НаСервере
Процедура ЗаполнитьКомплектующиеНаСервере()
	ДокОбъект = РеквизитФормыВЗначение("Объект");
	Если ДокОбъект.ПроверитьВведеннуюНоменклатуру() Тогда
		ЗначениеВРеквизитФормы(ДокОбъект, "Объект");
		Если Объект.ВидыКомплектов.Количество() > 0 И Объект.ВидыКомплектов[0].ВидКомплекта
			<> Перечисления.ВидыКомплектов.Комплект Тогда
			Сообщить("Заполнение только для спаек!");
			Возврат;
		КонецЕсли;
		ЗаполнитьКомплектующиеНаСервере_();
	Иначе
		Сообщить(
			"В документе могут быть указаны только спайки или только штуки (готовые комплекты). Разделите документ!");
	КонецЕсли;
	
КонецПроцедуры
&НаСервере
Процедура УправлениеВидимостью()
	Элементы.ГруппаКомплектующие.Видимость = Объект.ОтгрузкаКомплектов; 
КонецПроцедуры

&НаСервере
Процедура УправлениеДоступностью()
	
	СтатусыБлокировка = Новый Массив; 
	СтатусыБлокировка.Добавить(Перечисления.СтатусыПеремаркировки.КОтработкеЧЗ);
	СтатусыБлокировка.Добавить(Перечисления.СтатусыПеремаркировки.Обработано);
	СтатусыБлокировка.Добавить(Перечисления.СтатусыПеремаркировки.ОбработаноЧЗ);
	//++Данилова Е.В. 26.06.2026 Изм.№0000000222
	СтатусыБлокировка.Добавить(Перечисления.СтатусыПеремаркировки.КОтправкеНаСклад);
	//--Данилова Е.В. 26.06.2026 
	ТолькоПросмотр = СтатусыБлокировка.Найти(Объект.Статус) <> Неопределено; 
	
	//Валетов+ 07.07.2026 Проблема 0000000178 Блокируем по статусам в обеих базах
	////++Данилова Е.В. 26.06.2026 Изм.№0000000222  
	//ТолькоПросмотр = ПараметрыСеанса.ТипУзла = Перечисления.ТипУзлаИБ.УправляющееПодразделение; 
	////--Данилова Е.В. 26.06.2026 
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораНоменклатуры(ВыбранноеЗначение,ДопПараметры)Экспорт
	Если ВыбранноеЗначение = Неопределено Тогда
		Возврат; 
	КонецЕсли;
	Если ТипЗнч(ВыбранноеЗначение) = Тип("Массив") Тогда
		Для Каждого ВыбЭлемент Из ВыбранноеЗначение Цикл
			ДобавитьНовуюСтроку(ВыбЭлемент);			  
		КонецЦикла;
	ИначеЕсли 	ТипЗнч(ВыбранноеЗначение) = Тип("СправочникСсылка.Номенклатура") Тогда
		ДобавитьНовуюСтроку(ВыбранноеЗначение); 
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьНовуюСтроку(Знач ВыбЭлемент)
	
	Перем Отбор;
	Отбор = Новый Структура("Номенклатура",ВыбЭлемент);
	СтрокиТоваров = Объект.Товары.НайтиСтроки(Отбор);
	Если СтрокиТоваров.Количество() = 0  Тогда
		СтрокаТовара = Объект.товары.Добавить(); 
		СтрокаТовара.Номенклатура = ВыбЭлемент; 
		СтрокаТовара.Количество = 1;
		СтрокаТовара.Коэффициент = 1;  
	Иначе 
		СтрокаТовара = СтрокиТоваров[0]; 
		СтрокаТовара.Количество = СтрокаТовара.Количество + 1; 
	КонецЕсли;
	Если ВведенныйТоварСпайка(ВыбЭлемент) Тогда
		Объект.ОтгрузкаКомплектов = Истина;
		УправлениеВидимостью(); 
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьКомплектующиеНаСервере_()
	ДокОбъект = РеквизитФормыВЗначение("Объект");	
	ЗаполнениеДокументов.ЗаполнитьТЧКомплектующие(ДокОбъект);
	ЗначениеВРеквизитФормы(ДокОбъект,"Объект"); 
	ЗаполнитьКоличествоПродукции(); 
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьКоличествоПродукции()	
	
	Для Каждого СтрокаТЧ Из Объект.Комплектующие Цикл 
		СтрокаТЧ.КоличествоПродукции = 0;
	КонецЦикла;
		
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ТЧТовары.Номенклатура КАК Номенклатура,
		|	ТЧТовары.Количество КАК Количество,
		|	ТЧТовары.Коэффициент КАК Коэффициент
		|ПОМЕСТИТЬ ВТТовары
		|ИЗ
		|	&Товары КАК ТЧТовары
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТТовары.Номенклатура КАК Номенклатура,
		|	СУММА(ВТТовары.Количество * ВТТовары.Коэффициент) КАК Количество
		|ИЗ
		|	ВТТовары КАК ВТТовары
		|СГРУППИРОВАТЬ ПО
		|	ВТТовары.Номенклатура";
	Запрос.УстановитьПараметр("Товары", Объект.Товары.Выгрузить());
	РезультатЗапроса = Запрос.Выполнить();
	
	
	ТПродукции = РезультатЗапроса.Выгрузить();	
	
	Для Каждого СтрокаТЗ Из ТПродукции Цикл
		СтрокиКомплектующих = Объект.Комплектующие.НайтиСтроки(Новый Структура("Продукция",СтрокаТЗ.Номенклатура));
		Если СтрокиКомплектующих.Количество() > 0  Тогда
			СтрокиКомплектующих[0].КоличествоПродукции = СтрокаТЗ.Количество;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ВведенныйТоварСпайка(Знач Номенклатура)
	Возврат ОбщегоНазначенияС.ПолучитьРеквизитШапкиСервер(Номенклатура, "ВидКомплекта")
		= Перечисления.ВидыКомплектов.Комплект;
КонецФункции

&НаСервере
Процедура ОтработатьУдалениеНоменклатурыНаСервере()
	ПеремаркировкаОбъект = РеквизитФормыВЗначение("Объект"); 
	ПеремаркировкаОбъект.ПроверитьВведеннуюНоменклатуру(); 
	ЗначениеВРеквизитФормы(ПеремаркировкаОбъект, "Объект");
	Объект.ОтгрузкаКомплектов = Ложь; 
	Если Объект.ВидыКомплектов.Количество() > 0 И Объект.ВидыКомплектов[0].ВидКомплекта
		= Перечисления.ВидыКомплектов.Комплект Тогда
		Объект.ОтгрузкаКомплектов = Истина;
	КонецЕсли;
	УправлениеВидимостью();
	
КонецПроцедуры



#КонецОбласти
